Revit 2027 API
BuiltInFailures.SketchFailures.InvalidRoofCurveloopError Property
 Base sketch for roof is invalid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRoofCurveloopError { get; }
Public Shared ReadOnly Property InvalidRoofCurveloopError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRoofCurveloopError {
	FailureDefinitionId^ get ();
}
static member InvalidRoofCurveloopError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace